<div style="text-align: center; background-color: #5A96E3; font-family: 'Trebuchet MS', Arial, sans-serif; color: white; padding: 20px; font-size: 40px; font-weight: bold; border-radius: 0 0 0 0; box-shadow: 0px 6px 8px rgba(0, 0, 0, 0.2);">
  Visualize Data
</div>

In [37]:
import pandas as pd

## Read data

In [38]:
annual_pop_df = pd.read_csv("../data/processed/preprocess_OA.csv")

agri_employ_df = pd.read_csv("../data/processed/preprocess_OEA.csv")

rural_employ_df = pd.read_csv("../data/processed/preprocess_OER.csv")

products_df = pd.read_csv("../data/processed/preprocess_QV.csv")

values_df = pd.read_csv("../data/processed/preprocess_QCL.csv")

-   I will try to join them together on the `Year` value (data have the same year go together)

In [39]:
display(annual_pop_df.head(3))
display(agri_employ_df.head(3))
display(rural_employ_df.head(3))
display(values_df.head(3))
display(products_df.head(3))

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year,Unit,Value,Flag,Flag Description,Note
0,OA,Annual population,237,Viet Nam,511,Total Population - Both sexes,3010,Population - Est. & Proj.,1950,1000 No,25109.200,X,Figure from international organizations,NaN
1,OA,Annual population,237,Viet Nam,512,Total Population - Male,3010,Population - Est. & Proj.,1950,1000 No,12408.031,X,Figure from international organizations,NaN
2,OA,Annual population,237,Viet Nam,513,Total Population - Female,3010,Population - Est. & Proj.,1950,1000 No,12701.169,X,Figure from international organizations,NaN

,Domain Code,Domain,Area Code,Area,Indicator Code,Indicator,Sex Code,Sex,Year,Element Code,Element,Source Code,Source,Unit,Value,Flag,Flag Description,Note
0,OEA,Employment Indicators: Agriculture,237,Viet Nam,21144,"Employment in agriculture, forestry and fishin...",1,Total,1991,6199,Value,3043,ILO - ILO Modelled Estimates,1000 No,24059.27,X,Figure from international organizations,NaN
1,OEA,Employment Indicators: Agriculture,237,Viet Nam,21144,"Employment in agriculture, forestry and fishin...",1,Total,1992,6199,Value,3043,ILO - ILO Modelled Estimates,1000 No,24384.94,X,Figure from international organizations,NaN
2,OEA,Employment Indicators: Agriculture,237,Viet Nam,21144,"Employment in agriculture, forestry and fishin...",1,Total,1993,6199,Value,3043,ILO - ILO Modelled Estimates,1000 No,24641.43,X,Figure from international organizations,NaN

,Domain Code,Domain,Area Code,Area,Indicator Code,Indicator,Sex Code,Sex,Year,Element Code,Element,Source Code,Source,Unit,Value,Flag,Flag Description,Note
0,OER,Employment Indicators: Rural,237,Viet Nam,21087,"Employment by age, total (15+), rural areas",1,Total,2007,6199,Value,3023,Labour force survey,1000 No,34098.44,X,Figure from international organizations,Break in series: Methodology revised Repositor...
1,OER,Employment Indicators: Rural,237,Viet Nam,21087,"Employment by age, total (15+), rural areas",1,Total,2009,6199,Value,3023,Labour force survey,1000 No,34615.17,X,Figure from international organizations,Repository: ILO-STATISTICS - Micro data proces...
2,OER,Employment Indicators: Rural,237,Viet Nam,21087,"Employment by age, total (15+), rural areas",1,Total,2010,6199,Value,3023,Labour force survey,1000 No,35839.50,X,Figure from international organizations,Repository: ILO-STATISTICS - Micro data proces...

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year,Unit,Value,Flag,Flag Description
0,QV,Value of Agricultural Production,237,Viet Nam,152,Gross Production Value (constant 2014-2016 tho...,711,"Anise, badian, coriander, cumin, caraway, fenn...",1961,1000 Int. $,1521,E,Estimated value
1,QV,Value of Agricultural Production,237,Viet Nam,152,Gross Production Value (constant 2014-2016 tho...,711,"Anise, badian, coriander, cumin, caraway, fenn...",1962,1000 Int. $,1521,E,Estimated value
2,QV,Value of Agricultural Production,237,Viet Nam,152,Gross Production Value (constant 2014-2016 tho...,711,"Anise, badian, coriander, cumin, caraway, fenn...",1963,1000 Int. $,1521,E,Estimated value

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year,Unit,Value,Flag,Flag Description,Note
0,QCL,Crops and livestock products,237,Viet Nam,5312,Area harvested,711,"Anise, badian, coriander, cumin, caraway, fenn...",1961,ha,1000.0,E,Estimated value,NaN
1,QCL,Crops and livestock products,237,Viet Nam,5419,Yield,711,"Anise, badian, coriander, cumin, caraway, fenn...",1961,100 g/ha,7000.0,E,Estimated value,NaN
2,QCL,Crops and livestock products,237,Viet Nam,5510,Production,711,"Anise, badian, coriander, cumin, caraway, fenn...",1961,t,700.0,E,Estimated value,NaN

## We will join each format each data frame by year first

### Annual population

In [40]:
sub_df = []
tmp_df = annual_pop_df.drop(columns=['Note', 'Flag', 'Flag Description'])
for element in tmp_df['Element'].unique():
    sub_df.append(tmp_df[tmp_df['Element'] == element])

for i in range(len(annual_pop_df['Element'].unique())):
    unit = sub_df[i]['Unit'].values[0]
    element = sub_df[i]['Element'].values[0]
    sub_df[i] = sub_df[i].rename(columns= {'Value' : f"{element} ({unit})"})

    sub_df[i] = sub_df[i].drop(columns= ['Unit', 'Element', 'Element Code', 'Item', 'Item Code', 'Domain Code', 'Domain', 'Area Code', 'Area'])

join_df = sub_df[0]
for i in range(1, len(annual_pop_df['Element'].unique())):
    join_df = join_df.merge(sub_df[i], how= 'left', left_on= 'Year', right_on= 'Year' )

annual_pop_reformat_df = join_df

In [83]:
annual_pop_reformat_df.head()

,Year,Total Population - Both sexes (1000 No),Total Population - Male (1000 No),Total Population - Female (1000 No),Rural population (1000 No),Urban population (1000 No)
0,1950,25109.200,12408.031,12701.169,21921.843,2888.063
1,1951,25627.533,12640.675,12986.858,22341.053,3023.400
2,1952,26189.593,12895.406,13294.186,22806.351,3170.487
3,1953,26820.851,13185.537,13635.315,23316.645,3329.527
4,1954,27507.453,13511.290,13996.163,23869.466,3501.236

### Crops and livestock products

In [99]:
sub_df = []
tmp_df = products_df.drop(columns=['Note', 'Flag', 'Flag Description'])
for element in tmp_df['Element'].unique():
    sub_df.append(tmp_df[tmp_df['Element'] == element])

for i in range(len(tmp_df['Element'].unique())):
    unit = sub_df[i]['Unit'].values[0]
    element = sub_df[i]['Element'].values[0]
    sub_df[i] = sub_df[i].rename(columns= {'Value' : f"{element} ({unit})"})

    sub_df[i] = sub_df[i].drop(columns= ['Unit', 'Element', 'Element Code', 'Item Code', 'Domain Code', 'Domain', 'Area Code', 'Area'])

join_df = sub_df[0]
for i in range(1, len(sub_df)):
    join_df = join_df.merge(sub_df[i], how= 'left', left_on= ['Year', 'Item'], right_on= ['Year', 'Item'] )

join_df

,Item,Year,Area harvested (ha),Yield (100 g/ha),Production (t),Stocks (No),Prod Popultn (No),Producing Animals/Slaughtered (An),Laying (1000 An),Yield/Carcass Weight (100 g/An),Milk Animals (An)
0,"Anise, badian, coriander, cumin, caraway, fenn...",1961,1000.0,7000.0,700.00,NaN,NaN,NaN,NaN,NaN,NaN
1,"Anise, badian, coriander, cumin, caraway, fenn...",1962,1000.0,7000.0,700.00,NaN,NaN,NaN,NaN,NaN,NaN
2,"Anise, badian, coriander, cumin, caraway, fenn...",1963,1000.0,7000.0,700.00,NaN,NaN,NaN,NaN,NaN,NaN
3,"Anise, badian, coriander, cumin, caraway, fenn...",1964,1000.0,8500.0,850.00,NaN,NaN,NaN,NaN,NaN,NaN
4,"Anise, badian, coriander, cumin, caraway, fenn...",1965,1000.0,8700.0,870.00,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
3088,Vegetables Primary,2017,984965.0,159639.0,15723915.48,NaN,NaN,NaN,NaN,NaN,NaN
3089,Vegetables Primary,2018,1006678.0,161589.0,16266791.68,NaN,NaN,NaN,NaN,NaN,NaN
3090,Vegetables Primary,2019,991058.0,168246.0,16674164.74,NaN,NaN,NaN,NaN,NaN,NaN
3091,Vegetables Primary,2020,996952.0,170584.0,17006433.11,NaN,NaN,NaN,NaN,NaN,NaN
3092,Vegetables Primary,2021,1002974.0,171731.0,17224210.24,NaN,NaN,NaN,NaN,NaN,NaN

In [101]:
join_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3093 entries, 0 to 3092
Data columns (total 11 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   Item                                3093 non-null   object
 1   Year                                3093 non-null   int64
 2   Area harvested (ha)                 3093 non-null   float64
 3   Yield (100 g/ha)                    2983 non-null   float64
 4   Production (t)                      3093 non-null   float64
 5   Stocks (No)                         0 non-null      float64
 6   Prod Popultn (No)                   0 non-null      float64
 7   Producing Animals/Slaughtered (An)  0 non-null      float64
 8   Laying (1000 An)                    0 non-null      float64
 9   Yield/Carcass Weight (100 g/An)     0 non-null      float64
 10  Milk Animals (An)                   0 non-null      float64
dtypes: float64(9), int64(1), object(1)
memory usage: 290.0+ KB

-   `Stocks (No)`, `Prod Popultn (No)`, `Producing Animals/Slaughtered (An)`, `Laying (1000 An)`, `Yield/Carcass Weight (100 g/An)`, `Milk Animals (An)` is all null, so we drop all of them

In [102]:
join_df = join_df.drop(columns= ['Stocks (No)', 'Prod Popultn (No)', 'Producing Animals/Slaughtered (An)', 'Laying (1000 An)', 'Yield/Carcass Weight (100 g/An)', 'Milk Animals (An)'])
join_df

,Item,Year,Area harvested (ha),Yield (100 g/ha),Production (t)
0,"Anise, badian, coriander, cumin, caraway, fenn...",1961,1000.0,7000.0,700.00
1,"Anise, badian, coriander, cumin, caraway, fenn...",1962,1000.0,7000.0,700.00
2,"Anise, badian, coriander, cumin, caraway, fenn...",1963,1000.0,7000.0,700.00
3,"Anise, badian, coriander, cumin, caraway, fenn...",1964,1000.0,8500.0,850.00
4,"Anise, badian, coriander, cumin, caraway, fenn...",1965,1000.0,8700.0,870.00
...,...,...,...,...,...
3088,Vegetables Primary,2017,984965.0,159639.0,15723915.48
3089,Vegetables Primary,2018,1006678.0,161589.0,16266791.68
3090,Vegetables Primary,2019,991058.0,168246.0,16674164.74
3091,Vegetables Primary,2020,996952.0,170584.0,17006433.11
3092,Vegetables Primary,2021,1002974.0,171731.0,17224210.24

### Value of Agricultural Production

In [43]:
sub_df = []
tmp_df = values_df.drop(columns=['Flag', 'Flag Description'])
for element in tmp_df['Element'].unique():
    sub_df.append(tmp_df[tmp_df['Element'] == element])

for i in range(len(tmp_df['Element'].unique())):
    unit = sub_df[i]['Unit'].values[0]
    element = sub_df[i]['Element'].values[0]
    sub_df[i] = sub_df[i].rename(columns= {'Value' : f"{element} ({unit})"})

    sub_df[i] = sub_df[i].drop(columns= ['Unit', 'Element', 'Element Code', 'Item Code', 'Domain Code', 'Domain', 'Area Code', 'Area'])

join_df = sub_df[0]
for i in range(1, len(sub_df)):
    join_df = join_df.merge(sub_df[i], how= 'left', left_on= ['Year', 'Item'], right_on= ['Year', 'Item'] )

values_reformat_df = join_df

In [77]:
values_reformat_df.head(3)

,Item,Year,Gross Production Value (constant 2014-2016 thousand I$) (1000 Int. $),Gross Production Value (current thousand SLC) (1000 SLC),Gross Production Value (current thousand US$) (1000 USD),Gross Production Value (constant 2014-2016 thousand SLC) (1000 SLC),Gross Production Value (constant 2014-2016 thousand US$) (1000 USD)
0,"Anise, badian, coriander, cumin, caraway, fenn...",1961,1521,NaN,NaN,NaN,NaN
1,"Anise, badian, coriander, cumin, caraway, fenn...",1962,1521,NaN,NaN,NaN,NaN
2,"Anise, badian, coriander, cumin, caraway, fenn...",1963,1521,NaN,NaN,NaN,NaN

### Employment Indicators: Agriculture

In [64]:
agri_employ_df['Source'].unique()

array(['ILO - ILO Modelled Estimates', 'Labour force survey'],
      dtype=object)

-   all the source is the same, I don't need that, drop the `Source` and `Source Code` column

In [81]:
sub_df = []
tmp_df = agri_employ_df.drop(columns=['Flag', 'Flag Description', 'Note', 'Source', 'Source Code', 'Element', 'Element Code', 'Domain Code', 'Domain', 'Area Code', 'Area', 'Sex Code'])
for indicator in tmp_df['Indicator'].unique():
    sub_df.append(tmp_df[tmp_df['Indicator'] == indicator])

for i in range(len(tmp_df['Indicator'].unique())):
    unit = sub_df[i]['Unit'].values[0]
    element = sub_df[i]['Indicator'].values[0]
    sub_df[i] = sub_df[i].rename(columns= {'Value' : f"{element} ({unit})"})

    sub_df[i] = sub_df[i].drop(columns= ['Unit', 'Indicator', 'Indicator Code'])

join_df = sub_df[0]
join_df = join_df.merge(sub_df[1], how= 'left', left_on= ['Year', 'Sex'], right_on= ['Year', 'Sex'] )

join_df[join_df['Year'] == 1991]

,Sex,Year,"Employment in agriculture, forestry and fishing - ILO modelled estimates (1000 No)",Agriculture value added per worker (constant 2015 US$) (USD)
0,Total,1991,24059.27,557.6
31,Male,1991,11695.29,NaN
62,Female,1991,12368.90,NaN

### Employment Indicators: Rural